# WallHeight

## Description
_Vectorworks 2012 Deprecated Functions_. See architectural category for replacement:
:DelObjStoryBound
:DelObjStoryBounds
:GetObjBoundElevation
:GetObjStoryBound
:GetObjStoryBoundsAt
:GetObjStoryBoundsCnt
:GetStoryLayerInfo
:HasObjStoryBound
:HasObjStoryBounds
:SetObjectStoryBound

Procedure WallHeight returns the wall heights of the referenced wall object.

```pascal
PROCEDURE WallHeight(
				wallHd      : HANDLE;
				VAR startHt : REAL;
				VAR endHt   : REAL);
```

```python
def vs.WallHeight(wallHd):
    return (startHt, endHt)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wallHd|HANDLE|Handle to wall.|
|startHt|REAL|Returns start height of wall.|
|endHt|REAL|Returns end height of wall.|

## Examples
```pascal
WallHeight(wallHd, 1.0, 2.0);
```
```python
import vs

# _Vectorworks 2012 Deprecated Functions_.
wallHd = vs.FSActLayer()  # handle to the first selected object on the active layer

startHt, endHt = vs.WallHeight(wallHd)
vs.Message('WallHeight returned: ' + str((startHt, endHt)))
```

## Version
Availability: from MiniCAD6.0
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Objects - Walls